{"author": ["HJ"], "description": "Attackers compress files for data exfiltration", "enabled": true, "false_positives": ["Unknown"], "filters": [], "from": "now-120s", "immutable": false, "index": ["mac*"], "interval": "1m", "rule_id": "25e10275-dec5-4af3-8856-50b434bb055d", "language": "lucene", "output_index": ".siem-signals-default", "max_signals": 100, "risk_score": 5, "name": "Scen1-Tahoe-Data_Collection_via_zip", "query": "(aul.processImagePath:\"\" AND aul.subsystem:\"\" AND aul.eventMessage:\"zip\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["Collection"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1560/001"]}
{"author": ["HJ"], "description": "Attackers can infiltrate by disguising themselves as legitimate apps.", "enabled": true, "false_positives": ["Legitimate app execute."], "filters": [], "from": "now-120s", "immutable": false, "index": ["mac*"], "interval": "1m", "rule_id": "be678a9b-8080-4609-83c2-320f0d8dba45", "language": "lucene", "output_index": ".siem-signals-default", "max_signals": 100, "risk_score": 5, "name": "Scen1-Tahoe-app_execute", "query": "(aul.processImagePath:\"runningboardd\" AND aul.subsystem:\"com.apple.runningboard\" AND aul.eventMessage:\"Launch\\ request\" AND aul.eventMessage:\"application.com.example.niceview\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["Execution"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1204/"]}
{"author": ["HJ"], "description": "Attackers drop malicious files to use", "enabled": true, "false_positives": ["download Legitimate app or process"], "filters": [], "from": "now-120s", "immutable": false, "index": ["mac*"], "interval": "1m", "rule_id": "3cf39008-8621-4e12-b46b-1c3d9d52fd51", "language": "lucene", "output_index": ".siem-signals-default", "max_signals": 100, "risk_score": 5, "name": "Scen1-Tahoe-Splunkd_drop", "query": "(aul.processImagePath:\"kernel\" AND aul.subsystem:\"\" AND aul.eventMessage:\"responsibility\\ for\" AND aul.eventMessage:(\"splunkd\" OR \"apache\" OR \"Adobe\\ Flash\\ Player\\ Install\\ Manager\" OR \"lauchd\" OR \"kernl\"))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1105"]}
{"author": ["HJ"], "description": "Executing malicious files desired by the attacker", "enabled": true, "false_positives": ["Testing Legitimate app or mach-o file"], "filters": [], "from": "now-120s", "immutable": false, "index": ["mac*"], "interval": "1m", "rule_id": "69cb1ef3-ace9-4faa-b647-f7b765123684", "language": "lucene", "output_index": ".siem-signals-default", "max_signals": 100, "risk_score": 35, "name": "Scen1-Tahoe-Splunkd_Execute", "query": "((aul.processImagePath:(\"splunkd\" OR \"apache\" OR \"Adobe\\ Flash\\ Player\\ Install\\ Manager\" OR \"lauchd\" OR \"kernl\") AND aul.subsystem:\"\" AND aul.eventMessage:\"Retrieve\\ User\\ by\\ ID\") AND (NOT (aul.processImagePath.keyword:(\\/System\\/Library\\/* OR \\/usr\\/libexec* OR \\/usr\\/sbin\\/* OR \\/System\\/Applications\\/* OR \\/Applications\\/* OR \\/kernel*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Execution"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1059/004"]}
{"author": ["HJ"], "description": "Open ports for C2", "enabled": true, "false_positives": ["Unknown"], "filters": [], "from": "now-120s", "immutable": false, "index": ["mac*"], "interval": "1m", "rule_id": "78b548f1-8529-46ae-915d-e55387fbd663", "language": "lucene", "output_index": ".siem-signals-default", "max_signals": 100, "risk_score": 35, "name": "Scen1-Tahoe-Splunkd_Reverseshell", "query": "((aul.processImagePath:\"kernel\" AND aul.subsystem:\"\" AND aul.eventMessage:\"tcp\\ connected\\:\\ \") AND (NOT (aul.eventMessage:(\"\\:80\\]\" OR \"\\:443\\]\" OR \"\\:5601\\]\" OR \"\\:5045\\]\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1571"]}
