{"author": ["HJ"], "description": "Attackers compress files for data exfiltration", "enabled": true, "false_positives": ["Unknown"], "filters": [], "from": "now-120s", "immutable": false, "index": ["mac*"], "interval": "1m", "rule_id": "25e10275-dec5-4af3-8856-50b434bb055d", "language": "lucene", "output_index": ".siem-signals-default", "max_signals": 100, "risk_score": 5, "name": "Scen1-Tahoe-Data_Collection_via_zip", "query": "(aul.processImagePath:\"\" AND aul.subsystem:\"\" AND aul.eventMessage:\"zip\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["Collection"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1560/001"]}
